using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HDL_Buspro_Setup_Tool
{
    class NormalPanelDeviceTypeList
    {
        public static int[] HDLNormalPanelDeviceTypeList = new int[]{  // 所有有线面板设备类型列表
            216,217,218,219,220,221,222,223,224,225,226,227,
            245,246,247,248,241,
            249,250,251,252,253,254,255,256,257,258,259,260,
            261,262,263,264,265,266,267,268,269,270,271,
            272,273,274,275,276,277,278,279,280,
            281,282,283,284,285,286,287,288,289,290,
            291,292,293,294,295,296,297,298,299,604,
            605,3050,3051,3052,3053,
            48,86,87,149,154,155,156,157,158,159,160,162,165,167,168,170,172,175,176,180,
            2001,2002,2003,2004,2005,2006,2007,2008,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025,
            2026,2027,2028,2029,2030,
            2031,2032,2033,2034,2035,2036,2037,2038,2039,2040,2041,2042,2043,2044,2045,2046,2047,2048,2049,2050,2051,2052,2053,2054,
            2055,2056,2057,2058,2059,2060,2061,2062,2063,2064,2065,2069,2070,
            2073,2074,2075,2076,
            5000,5001,5002,5004,
            // 无线面板
            1501,
            5000,5001,5002,5003,5005,
            5030, 5031, 5032, 5033, 5034, 5035, 5036, 5037, 5038, 5039, 5040, 5041, 
            5042,5043,5044,5045,5046,5047,5048,5049,5050,5051,5052,5053,5054,5055,5056,5057,5058,5059,5060,5061,5062,5063,
            5300,5301,5065,5066,           
            6101
        };

        public static int[] PanelBigButtonDeviceList = new int[] {
            2001,2002,2003,2004,
            2010,2011,2012,2013,2025,2026,
            2044,2045,2046,2047,2048,2049,2050,2051,
            2076
        }; //大按键面板

        public static int[] NormalTouchButtonPanelOldIcDeviceType = new int[] {223,224,225,226,  //旧版触摸按键
            2022,2023,2024,2029,2030,2031,2032,
            2073,2074,2075,2076
        };

        public static int[] NormalTouchButtonPanelDeviceType = new int[] {223,224,225,226,   //普通触摸按键
            2022,2023,2024,2029,2030,2031,2032,
            2061,2062,2063,2064,2065,2069,2070,
            2073,2074,2075
        };

        public static int[] NormalRoundButtonPanelDeviceType = new int[] { 2019, 2020, 2021, 2040, 2041, 2042, 2043 }; //wifi圆按键面板
        

        public static int[] PanelHasNoBalanceLightDeviceType = new int[] { 
            2032, 2073,2074,2075
        };

        public static int[] IranSpeicalTouchButtonPanelDeviceType = new int[] {   //伊朗定制版触摸按键
            2073,2074,2075
        };

        public static int[] TouchPanelGenerationOneWithOutTemperature = new int[]{  //第一版触摸面板不带温度
            223,224,225,226,2073,2074,2075,2076
        };
        public static int[] PanelKorayPanelWithOutTemperature = new int[] { 2005,2006,2007,2008};

        public static int[] NormalWIFIPanelDeviceType = new int[] { 5000,5001,5002,5003,5004,5005, 
            5030, 5031, 5032, 5033, 5034, 5035, 5036, 5037, 5038, 5039, 5040, 5041, 
            5042,5043,5044,5045,5046,5047,5048,5049,5050,5051,5052,5053,5054,5055,5056,5057,5058,5059,5060,5061,5062,5063,5064,5065}; //wifi面板

        public static int[] NormalWIFIRoundButtonPanelDeviceType = new int[] { 5034, 5035, 5036, 5037, 5046, 5047, 5048, 5049, 5054 }; //wifi圆按键面板
        public static int[] NormalWIFIThouchPanelDeviceType = new int[] { 5038, 5039, 5040, 5041, 5050, 5051, 5052, 5053, 5055, 5056, 5057, 5058, 5059, 5060, 5061 }; //wifi触摸面板
        public static int[] NormalNewWIFIPanelDeviceType = new int[] { 5001, 5002,5003,5004, 5005, 5042, 5043, 5044, 5045, 5046, 5047, 5048, 5049, 5050, 5051, 5052, 5053, 5054, 5055,5056,5057,
                                                                     5058,5059,5060,5061,5062,5063};//12无线回路，调光信息无线面板

        public static int[] WirelessSimpleFloorHeatingDeviceTypeList = new int[] { 5003,5005  // 所有简单地热控制面板
        };

        public static int[] minAllWirelessDeviceType = new int[] { //所有无线设备
        1500,1501,
        5000,5001,5002,5003,5005,
        5030, 5031, 5032, 5033, 5034, 5035, 5036, 5037, 5038, 5039, 5040, 5041, 
        5042,5043,5044,5045,5046,5047,5048,5049,5050,5051,5052,5053,5054,5055,5056,5057,5058,5059,5060,5061,5062,5063,5064,5065,
        5300,5301,5302,
        5500,5501,
        5700,5701,5702,
        5900,
        6100,6101,6102
        };
 
    }
}
